
win_x, win_y = 200, 100
win_width, win_height = 1000, 600

txt_hello = 'Добро пожаловать в программу по определению состояния здоровья!'
txt_next = 'Начать'
txt_instruction = 'Данное приложение позволит вам с помощью теста Руфье провести первичную диагностику вашего здоровья.\nПроба Руфье представляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрузке.\nУ испытуемого, находящегося в положении лежа на спине в течениие 5 мин, определяют частоту пульса за 15 секунд;\nзатем в течение 45 секунд испытуемый выполняет 30 приседаний.\nПосле окончания нагрузки испытуемый ложится, и у него вновь подсчитывается число пульсаций за первые 15 секунд,\nа потом - за последние 15 секунд первой минуты периода восстановления.\nВажно! Если в процессе проведения испытания вы почувствуете себя плохо (появится головокружение, шум в\nушах, сильная одышка и др.) то тест необходимо прервать и обратиться к врачу.   ' 
txt_title = 'Здоровье'
txt_name = 'Введите Ф.И.О:'
txt_hintname = "Ф.И.О."#Для эдита
txt_hintage = "Полных лет:"
txt_test1 = '''Лягте на спину и замерьте пульс на 15 секунд. Нажмите кнопку "Начать первый тест,"
чтобы запустить таймер.\nРезультат запишите в соответствующее поле.'''

txt_test2 = '''Выполните 30 приседаний за 45 секунд. Для этого нажмите на кнопку
"Начать делать приседания", чтобы запустить счетчик присдений'''

txt_test3 = '''Лягте на спину и замерьте пульс сначала за первые 15 секунд минуты,
а затем за последние 15 секунд.\nНажмите кнопку "Начать финальный тест",
чтобы запустить таймер.\nЗеленым обозначены секунды, в течение которых необходимо
проводить измерения, чёрным - минуты без замера пульса. Результаты
запишите в соответствующие поля.'''
txt_sendresults = 'Отправить результаты'
txt_hinttest1 = '0'
txt_hinttest2 = '0'
txt_hinttest3 = '0'
txt_starttest1 = 'Начать первый тест'
txt_starttest2 = 'Начать делать присидания'
txt_starttest3 = 'Начальный финальный тест'

txt_age = '0'
txt_finalwin = 'Результаты'
txt_index = 'Индекс Руфье: '
txt_workheart = 'Работоспособность сердца: '

txt_res1 = "Низкий"
txt_res2 = "Удовлетворительный"
txt_res3 = "Средний"
txt_res4 = "Выше среднего"
txt_res5 = "Высокий"

